$(document).ready(function ()
{
    var vitel_sighs =
        ({
            "bp": [
            {
                "subject": "הגדרה",
                "content": "חץ דם הוא הלחץ שמפעיל הדם על דפנות כלי הדם. המונח לחץ דם מתייחס ללחץ דם עורקי אלא אם כן מצוין אחרת. לחץ הדם העורקי הוא הלחץ בעורקים המובילים דם לאיברי גוף (לא בעורקי הריאה), למשל בעורק הזרוע. לחץ הדם נמדד ביחידות של מילימטר כספית (mmHg). לחץ דם גבוה מאוד או נמוך מאוד עלול להוביל להפרעה בתפקוד ולהרעה במצב הבריאותי.נהוג להתייחס לשני ערכי לחץ דם בולטים: לחץ דם סיסטולי, שהוא לחץ השיא בזמן התכווצות חדרי הלב, ולחץ דם דיאסטולי, שהוא הלחץ הנמוך ביותר בזמן הרפיית החדרים. ",

            },
            {
                "subject": "ערכים נורמאלים",
                "content": "ערכים תקינים עבור אדם בוגר בריא בזמן מנוחה נעים סביב לחץ סיסטולי של 120 מילימטר  כספית ולחץ דיאסטולי של 80 מילימטר  כספית (נכתב בצורה 120/80 מילימטר כספית).",
                
               
                
            },
            {
                "subject": "גורמים משפיעים",
                "content": "מאמץ גופני  מעלה לחץ דם על ידי העלאת תפוקתהלב. לכן מודדים לחץ דם לאחר מנוחה של 20 עד 30דקות.גורמים רגשיים כמו פחד, מתח והתרגשותמעלים את לחץ הדם הסיסטולי. גירו מערכת הסימפטיתית מעלה תנגודת פיריפרית וכן אתתפוקת הלב.לחץ הדם הסיסטולי הוא נמוך ביותר בזמןהשינה .פעילות מטבולית נמוכה.בשעות אחר הצהרייםשיא עלית לחץ הדם.כאבים חזקים מורידים לחץ הדם עי דיכויהמרכז הוזומוטורי וגורם לוזודלטציה ",
               
            },

            {
                "subject": "מדידת לחץ דם",
                "content": "בשיטה הלא-פולשנית אשר בה משתמשים כיום מניחים את השרוולית של מד לחץ הדם על עורק הזרוע בגובה הלב ומאזינים למסכת מתחת לגובה השרוולית תוך חישת הדופק בעורק החישור. מנפחים את השרוולית ללחץ של כ-200מילימטר כספית, שבו עורק הזרוע עובר תמט ולא זורם דרכו דם. בשלב זה לא יישמעו קולות במסכת ולא יוחש דופק בעורק החישור. אט אט מורידים את הלחץ בשרוולית עד לתחושת דופק בעורק החישור. מכיוון שהזרימה אז דרך העורק היא זרימה טורבולנטית, ניתן לשמוע דרך המסכת את קולות קורוטקוף. הלחץ בנקודה זו הוא הלחץ הסיסטולי. ממשיכים להוריד את הלחץ בשרוולית עד שחדלים לשמוע את קולות קורוטקוף, דבר שמעיד על כך שהזרימה חזרה להיות שכבתית. הלחץ בנקודה זו הוא הלחץ הדיאסטולי. ",

            },

            ],

            "pols": [

            {
                "subject":"הגדרת הדופק",
                "content": "דופק הוא הכינוי להתכווצות והתרחבות קצבית של עורק באמצעות זרימת דם על ידי הלב. באמצעות הדופק ניתן לבדוק את מספר פעימות הלב בדקה, כלומר את קצב הלב."
            },

            
            {
                "subject":"ערכים נרמאלים של הדופק",
            "content": "הדופק הסטנדרטי של ילדים גדולים ומבוגרים (גיל 8+) במצב מנוחה הוא 60-100 פעימות לדקה, של ילדים (גיל 1-8) הוא 80-120 פעימות בדקה ושל תינוקות (גיל 0-1) - 100-120 פעימות."
            },

             {
                 "subject": "גורמים המשפיעים על הדופק",
                 "content": "הדופק מושפע מנפח הפעימה של הלב - כמות הדם שמזרים הלב בכל פעימה; ומכמות הדם שהלב צריך להזרים בדקה - תפוקת לב. במצב מנוחה, על הלב להזרים בדקה אחת את כל כמות הדם שבגוף, בממוצע - 4.5 ליטרים אצל אישה ו-5.5 אצל גבר. בזמן מאמץ, פעילות גופנית, התרגשות או פחד, על הלב להזרים יותר דם על מנת לספק יותר חמצן לשרירים, ולפיכך הדופק עולה.אצל ספורטאים, אשר מתאמנים דרך קבע במצב של דופק מהיר, שריר הלב מתפתח וגדל, וכך גם גדל נפח הפעימה של הלב ובהתאם יורד קצב פעימות הלב במצב מנוחה. ערכי דופק במצב מנוחה לספורטאים הם 40-60 לדקה, וכך גם לאנשים אשר שומרים על כושר גופני גבוה. במאמץ אצל אדם ממוצע תפוקת הלב גדלה עד פי 6 מהתפוקה הרגילה."
             },

             {
                 "subject": "מדידת דופק",
                 "content": " במדידת דופק בעזרת מישוש עורק החישור מניחים שתי אצבעות בין גיד השריר כופף שורש היד החישורי (הגיד הבולט ביותר בקדמת האמה) לגידי האגודל הסמוכים לו (באזור שורש האגודל) ולוחצים בעדינות על המקום עד שמאתרים את הפעימות (ראו תמונה). מדידה בעזרת האגודל עלולה לתת תוצאה כוזבת שכן גם בו ניתן לחוש פעימות. לחישוב מספר פעימות הלב בדקה מונים 15 שניות ומכפילים את התוצאה בארבע, או שמשתמשים בשיטת מנייה והכפלה אחרת על פי הנוחות ולפי רמת הדיוק הנדרשת (ככל שזמן המנייה ארוך יותר כך התוצאה מדויקת יותר). אצל תינוק המדידה מתבצעת בעורק הזרוע שחולף בחלקה הפנימי של הזרוע באותו אופן שמתבצעת המדידה אצל מבוגר. בהחייאה מודדים דופק בעורק התרדמני שנמצא בצוואר.בעבר היה נהוג לבדוק את הדופק המקסימלי בנוסחה הבאה: 220-הגיל, כלומר על פי הנוסחה הדופק המקסימלי של תינוק בן יומו הוא: 220, ואילו הדופק המרבי של אדם בן 20 הוא: 200. כיום נהוג לחשב את הדופק המקסימלי בדרכים שונות ומגוונות."
             }
            ],

            //*****************************************חום***********************************************
            "temp": [

           {
               "subject": "הגדרת חום הגוף",
               "content": "חום הוא מדד הבודק את טמפרטורת הגוף. כאשר הטמפרטורה גבוהה מידי או נמוכה מידי הדבר מצביע בדרך כלל על מצב קליני אף שנהוג לומר שטמפרטורת הגוף הנורמלית היא 37.0 מעלות צלזיוס, מדובר בערך חישובי ממוצע ולא בערך קבוע. מפני שאצל אדם בריא טמפרטורת הגוף עולה ויורדת במהלך היממה, כאשר בשעת הקימה בבוקר טמפרטורת הגוף היא הנמוכה ביותר, והיא עולה מעט לקראת שעות אחרי הצהרים והערב. טמפרטורת הגוף התקינה המרבית נעה בין 37.1 מעלות צלזיוס בשעות הבוקר לבין 37.3 בשעות אחר הצהרים והערב.החום הדרוש לאדם הוא כ-36.6 מעלות צלזיוס. באשכי הגבר, למשל, יש צורך בטמפרטורה נמוכה יותר, ולכן הם נמצאים בשקיק אשכים מחוץ לגוף (החום עלול לגרום לעקרות חלקית, כלומר לירידה בכמות תאי הזרע בנוזל הזרע, ומכאן להקטנת הסיכוי להפריה). "
           },


          {
              "subject": "מדדים נורמלים של חום הגוף",
              "content": "טווח הנורמלי של °C‏ 36.5–37.5 במדידה הנעשית בפה (או מעל 38 מעלות צלזיוס במדידה בפי הטבעת). טמפרטורה בטווח של 37.3-37.4 נחשבת כחום תת-פיברילי"
          },

           {
               "subject": "גורמים המשפיעים על החום",
               "content": "חום הגוף נקבע באמצעות וסת חום הנמצא בבלוטת ההיפותלמוס שבמוח. עלייה בחום הגוף מתרחשת לאחר שינוי מידת החום בהיפותלמוס באמצעות פעילות מוגברת של השרירים ומכיווצם, ובצורתה הקיצונית מורגשות רעידות וצמרמורות. בנוסף, גורמת ההיפותלמוס להעברה של דם משטח הפנים של העור אל פנים הגוף, דבר המסייע להפחתת איבוד חום הגוף דרך העור. כשאין צורך עוד ברמת חום גבוהה, מכוון וסת החום את עצמו לרמתו הנורמלית והגוף משתחרר מחום עודף באמצעות הזעה והעברת דם מפנים הגוף אל פני העור. בלשון רפואית נקראת תופעת החום הגבוה פירקסיה (Pyrexia). חומרים הגורמים לעלייה בחום הגוף בעקבות שינוי הווסת בהיפותלמוס נקראים חומרים פירוגנים והם נוצרים מחוץ לגוף או בתוכו. פירוגנים המיוצרים בתוך הגוף נוצרים לרוב על ידי מונוציטים, שהם סוג מסוים של תאי דם לבנים. פירוגנים הנוצרים מחוץ לגוף מצויים למשל במיקרואורגניזמים וברעלנים שהם מייצרים, והם גורמים לעלייה בחום הגוף על ידי גירוי הגוף לשחרר פירוגנים משלו הגורמים להיפותלמוס לקבוע רמת חום חדשה."
           },

           {
               "subject": "מדידת חום הגוף",
               "content": " מקובל למדוד את חום הגוף על ידי מד חום בצורה אנאלית או אוראלית כאשר מדידה של °C‏ 36.5–37.5 במדידה הנעשית בפה או מעל 38 מעלות צלזיוס במדידה בפי הטבעת "
           }
            ]
        });

    $("p.pb_def ").append(vitel_sighs.bp[0].content);
    $("h3.pb_def ").append(vitel_sighs.bp[0].subject);

    $("p.normal_valus ").append(vitel_sighs.bp[1].content);
    $("h3.normal_valus ").append(vitel_sighs.bp[1].subject);

    $("p.Affecting_Factors ").append(vitel_sighs.bp[2].content);
    $("h3.Affecting_Factors ").append(vitel_sighs.bp[2].subject);

    $("p.measure ").append(vitel_sighs.bp[3].content);
    $("h3.measure ").append(vitel_sighs.bp[3].subject);


    //*********************דופק**********************************************

    $("p.pols_def ").append(vitel_sighs.pols[0].content);
    $("h3.pols_def ").append(vitel_sighs.pols[0].subject);

    $("p.pols_normal_valus ").append(vitel_sighs.pols[1].content);
    $("h3.pols_normal_valus ").append(vitel_sighs.pols[1].subject);

    $("p.pols_Affecting_Factors ").append(vitel_sighs.pols[2].content);
    $("h3.pols_Affecting_Factors ").append(vitel_sighs.pols[2].subject);

    $("p.pols_measure ").append(vitel_sighs.pols[3].content);
    $("h3.pols_measure ").append(vitel_sighs.pols[3].subject);


    //*************************************חום***************************************


    $("p.temp_def ").append(vitel_sighs.temp[0].content);
    $("h3.temp_def ").append(vitel_sighs.temp[0].subject);

    $("p.temp_normal_valus ").append(vitel_sighs.temp[1].content);
    $("h3.temp_normal_valus ").append(vitel_sighs.temp[1].subject);

    $("p.temp_Affecting_Factors ").append(vitel_sighs.temp[2].content);
    $("h3.temp_Affecting_Factors ").append(vitel_sighs.temp[2].subject);

    $("p.temp_measure ").append(vitel_sighs.temp[3].content);
    $("h3.temp_measure ").append(vitel_sighs.temp[3].subject);


});